# Поработайте с переменными, создайте несколько, выведите на экран

variable_1 = 1
variable_2 = 2
print("значения обеих переменных : ", variable_1, 'и', variable_2)

# Запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

number_1 = int(input("Ведите первое число : "))
number_2 = int(input("Ведите второе число : "))
word_1 = input("Введите первое слово :")
word_2 = input("Введите второе слово :")
print("Ваши введеные числа", number_1, ',', number_2, '. Ваши введеные слова : ', word_1, ",", word_2)
